In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
datas = pd.date_range("20130101", periods=6)

In [6]:
datas

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas, columns=list("ABCD"))

In [9]:
df

                   A         B         C         D
2013-01-01  0.338031 -0.684560  0.481391  0.975440
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-03  0.353028 -0.169576  0.217120  0.300838
2013-01-04 -0.691003  0.135920 -1.150266  1.022870
2013-01-05  1.500745 -0.730564 -1.573155  0.520956
2013-01-06 -0.327571  0.998614  0.319752  2.525468

In [10]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [14]:
df2.<TAB> # noqa: E225, E999

SyntaxError: invalid syntax (2119590077.py, line 1)

In [15]:
df.head()

                   A         B         C         D
2013-01-01  0.338031 -0.684560  0.481391  0.975440
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-03  0.353028 -0.169576  0.217120  0.300838
2013-01-04 -0.691003  0.135920 -1.150266  1.022870
2013-01-05  1.500745 -0.730564 -1.573155  0.520956

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.691003  0.135920 -1.150266  1.022870
2013-01-05  1.500745 -0.730564 -1.573155  0.520956
2013-01-06 -0.327571  0.998614  0.319752  2.525468

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.to_numpy()

array([[ 0.33803145, -0.68455989,  0.4813907 ,  0.97543961],
       [-0.98372662,  0.98197905,  0.16411899, -0.74826001],
       [ 0.35302837, -0.16957579,  0.21711972,  0.30083791],
       [-0.69100301,  0.13591951, -1.15026552,  1.02287008],
       [ 1.50074496, -0.73056446, -1.57315536,  0.52095604],
       [-0.32757113,  0.99861365,  0.31975159,  2.52546798]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.031584  0.088635 -0.256840  0.766219
std    0.898627  0.769929  0.872947  1.074707
min   -0.983727 -0.730564 -1.573155 -0.748260
25%   -0.600145 -0.555814 -0.821669  0.355867
50%    0.005230 -0.016828  0.190619  0.748198
75%    0.349279  0.770464  0.294094  1.011012
max    1.500745  0.998614  0.481391  2.525468

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.338031   -0.983727    0.353028   -0.691003    1.500745   -0.327571
B   -0.684560    0.981979   -0.169576    0.135920   -0.730564    0.998614
C    0.481391    0.164119    0.217120   -1.150266   -1.573155    0.319752
D    0.975440   -0.748260    0.300838    1.022870    0.520956    2.525468

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.975440  0.481391 -0.684560  0.338031
2013-01-02 -0.748260  0.164119  0.981979 -0.983727
2013-01-03  0.300838  0.217120 -0.169576  0.353028
2013-01-04  1.022870 -1.150266  0.135920 -0.691003
2013-01-05  0.520956 -1.573155 -0.730564  1.500745
2013-01-06  2.525468  0.319752  0.998614 -0.327571

In [23]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  1.500745 -0.730564 -1.573155  0.520956
2013-01-01  0.338031 -0.684560  0.481391  0.975440
2013-01-03  0.353028 -0.169576  0.217120  0.300838
2013-01-04 -0.691003  0.135920 -1.150266  1.022870
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-06 -0.327571  0.998614  0.319752  2.525468

In [24]:
df["A"]

2013-01-01    0.338031
2013-01-02   -0.983727
2013-01-03    0.353028
2013-01-04   -0.691003
2013-01-05    1.500745
2013-01-06   -0.327571
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01  0.338031 -0.684560  0.481391  0.975440
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-03  0.353028 -0.169576  0.217120  0.300838

In [26]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-03  0.353028 -0.169576  0.217120  0.300838
2013-01-04 -0.691003  0.135920 -1.150266  1.022870

In [27]:
df.loc[datas[0]]

A    0.338031
B   -0.684560
C    0.481391
D    0.975440
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.338031 -0.684560
2013-01-02 -0.983727  0.981979
2013-01-03  0.353028 -0.169576
2013-01-04 -0.691003  0.135920
2013-01-05  1.500745 -0.730564
2013-01-06 -0.327571  0.998614

In [29]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [30]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [31]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.983727  0.981979
2013-01-03  0.353028 -0.169576
2013-01-04 -0.691003  0.135920

In [33]:
df.loc[datas[0], "A"]

0.3380314494752054

In [34]:
df.at[datas[0], "A"]

0.3380314494752054

In [35]:
df.iloc[3]

A   -0.691003
B    0.135920
C   -1.150266
D    1.022870
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.691003  0.135920
2013-01-05  1.500745 -0.730564

In [37]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.983727  0.164119
2013-01-03  0.353028  0.217120
2013-01-05  1.500745 -1.573155

In [38]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.983727  0.981979  0.164119 -0.748260
2013-01-03  0.353028 -0.169576  0.217120  0.300838

In [39]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.684560  0.481391
2013-01-02  0.981979  0.164119
2013-01-03 -0.169576  0.217120
2013-01-04  0.135920 -1.150266
2013-01-05 -0.730564 -1.573155
2013-01-06  0.998614  0.319752

In [40]:
df.iloc[1, 1]

0.9819790520122186

In [41]:
df.iat[1, 1]

0.9819790520122186

In [42]:
# Boolean indexing